vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXW235_DFP.pdsc
            __var ap0_disable=0x55aa;
            
            __errorcontrol = 1;
            
            // Execute SYSRESETREQ via AIRCR
            Write32(AIRCR_Addr, 0x05FA0004);
            
            __errorcontrol = 0;
            
            // Give bootloader time to do what it needs to do
            DAP_Delay(BootTime);  // try 10ms
            
            // Read AP0 CSW
            __dp = 0;
            __ap = 0;
            ap0_disable = ReadAP(0x0);
            ap0_disable = ((ap0_disable &amp; 0x40) == 0);
            Message(0, "AP0 DIS: %x", ap0_disable);
          </block>
          <control if="ap0_disable">
            <block>Sequence("WaitForStopAfterReset");</block>
          </control>
        </sequence>
        <sequence name="ResetProcessor" disable="1"/>
        <sequence name="TraceStart">
          <control if="__traceout &amp; 0x1" info="SWO Trace output selected">
            <block>Sequence("EnableTraceClk");       // Enable and configure trace clock</block>
            <control if="SWO_Pin == 0" info="SWO via PIO0_10">
              <block>
                Write32(0x40001028, 0x00000046); // Configure PIO0_10: FUNC - 6, MODE - 0, SLEW - 1, INVERT - 0, DIGMODE - 0, OD - 0
              </block>
            </control>
            <control if="SWO_Pin == 1" info="SWO via PIO0_8">
              <block>
                Write32(0x40001020, 0x00000044); // Configure PIO0_10: FUNC - 4, MODE - 0, SLEW - 1, INVERT - 0, DIGMODE - 0, OD - 0
              </block>
            </control>
          </control>
        </sequence>
      </sequences>
      <debugvars configfile="devices/MCXW235/arm/MCXW235.dbgconf">
        // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
        __var SWO_Pin               = 0;                    // Serial Wire Output pin: 0 = PIO0_10, 1 = PIO0_8
        __var Dbg_CR                = 0x00000000;           // DBG_CR
        __var BootTime              = 300000;                // 300 milliseconds
      </debugvars>
      <description>Ultra-low power, Highly Secure, Bluetooth LE 5.3 Wireless MCU.</description>
      <device Dname="MCXW235">
        <processor Dcore="Cortex-M33" Dfpu="SP_FPU" Dmpu="MPU" Dtz="TZ" Ddsp="DSP" Dendian="Little-endian" Dclock="32000000"/>
        <environment name="iar">
          <file category="linkerfile" name="devices/MCXW235/iar/MCXW235_flash.icf"/>
        </environment>
        <memory name="BootROM" start="0x03000000" size="0x040000" access="rx"/>
        <memory name="BootROM_alias" start="0x13000000" size="0x040000" access="rx" alias="BootROM"/>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x080000" access="rx" default="1" startup="1"/>
        <memory name="PROGRAM_FLASH_alias" start="0x10000000" size="0x080000" access="rw" alias="PROGRAM_FLASH"/>
        <memory name="SRAM" start="0x20004000" size="0x014000" access="rw" default="1"/>
        <memory name="SRAMX" start="0x04000000" size="0x4000" access="rw" default="1"/>
        <memory name="SRAMX_alias" start="0x14000000" size="0x4000" access="rw" alias="SRAMX"/>
        <memory name="SRAM_alias" start="0x30004000" size="0x014000" access="rw" alias="SRAM"/>
        <algorithm name="devices/MCXW235/arm/MCXW235.FLM" start="0x00000000" size="0x0080000" RAMstart="0x20004000" RAMsize="0x00008000" default="1"/>
        <algorithm name="devices/MCXW235/arm/MCXW235_S.FLM" start="0x10000000" size="0x00080000" RAMstart="0x20004000" RAMsize="0x00008000" default="1"/>
        <debug svd="devices/MCXW235/MCXW235.xml"/>
        <variant Dvariant="MCXW235BIHNAR">
          <compile header="devices/MCXW235/fsl_device_registers.h" define="CPU_MCXW235BIHNAR"/>
        </variant>
        <variant Dvariant="MCXW235BIUKAR">
          <compile header="devices/MCXW235/fsl_device_registers.h" define="CPU_MCXW235BIUKAR"/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="device.MCXW235.internal_condition">
      <accept Dname="MCXW235AIHNAR" Dvendor="NXP:11"/>
      <accept Dname="MCXW235AIUKAR" Dvendor="NXP:11"/>
      <accept Dname="MCXW235BIHNAR" Dvendor="NXP:11"/>
      <accept Dname="MCXW235BIUKAR" Dvendor="NXP:11"/>
    </condition>
    <condition id="cmake_toolchain.condition_id">
      <require condition="allOf.device=MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.device=MCXW235.internal_condition">
      <require condition="device.MCXW235.internal_condition"/>
    </condition>
    <condition id="component.ak4497_adapter.condition_id">
      <require condition="allOf.device=MCXW235.internal_condition"/>
    </condition>
    <condition id="component.at_least_one_i2c_mux_device_enabled.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_mux_pca954x, device=MCXW235.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_mux_pca954x"/>
      <require condition="device.MCXW235.internal_condition"/>
    </condition>
    <condition id="component.button.condition_id">
      <require condition="allOf.anyOf=allOf=component.lpc_gpio_adapter, driver.lpc_gpio, allOf=anyOf=driver.lpc_gpio, component.rt_gpio_adapter, component.timer_manager, device=MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.lpc_gpio_adapter, driver.lpc_gpio, allOf=anyOf=driver.lpc_gpio, component.rt_gpio_adapter, component.timer_manager, device=MCXW235.internal_condition">
      <require condition="anyOf.allOf=component.lpc_gpio_adapter, driver.lpc_gpio, allOf=anyOf=driver.lpc_gpio, component.rt_gpio_adapter.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mcxw23_timer_manager"/>
      <require condition="device.MCXW235.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.lpc_gpio_adapter, driver.lpc_gpio, allOf=anyOf=driver.lpc_gpio, component.rt_gpio_adapter.internal_condition">
      <accept condition="allOf.component.lpc_gpio_adapter, driver.lpc_gpio.internal_condition"/>
      <accept condition="allOf.anyOf=driver.lpc_gpio, component.rt_gpio_adapter.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpc_gpio_adapter, driver.lpc_gpio.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_gpio_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpc_gpio, component.rt_gpio_adapter.internal_condition">
      <require condition="anyOf.driver.lpc_gpio.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rt_gpio_adapter"/>
    </condition>
    <condition id="anyOf.driver.lpc_gpio.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
    </condition>
