vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXW235_DFP.pdsc
    <condition id="component.mflash_offchip.condition_id">
      <require condition="allOf.anyOf=driver.romapi, driver.spifi, device=MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.romapi, driver.spifi, device=MCXW235.internal_condition">
      <require condition="anyOf.driver.romapi, driver.spifi.internal_condition"/>
      <require condition="device.MCXW235.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.romapi, driver.spifi.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="romapi"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="spifi"/>
    </condition>
    <condition id="component.mflash_onchip.condition_id">
      <require condition="allOf.anyOf=driver.romapi, device=MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.romapi, device=MCXW235.internal_condition">
      <require condition="anyOf.driver.romapi.internal_condition"/>
      <require condition="device.MCXW235.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.romapi.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="romapi"/>
    </condition>
    <condition id="component.mflash_onchip_fmu.condition_id">
      <require condition="allOf.device=MCXW235.internal_condition"/>
    </condition>
    <condition id="component.mrt_adapter.condition_id">
      <require condition="allOf.driver.mrt, device=MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.driver.mrt, device=MCXW235.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mrt"/>
      <require condition="device.MCXW235.internal_condition"/>
    </condition>
    <condition id="component.ostimer_adapter.condition_id">
      <require condition="allOf.driver.ostimer, device=MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.driver.ostimer, device=MCXW235.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer"/>
      <require condition="device.MCXW235.internal_condition"/>
    </condition>
    <condition id="component.panic.condition_id">
      <require condition="allOf.device=MCXW235.internal_condition"/>
    </condition>
    <condition id="component.pcm186x_adapter.condition_id">
      <require condition="allOf.device=MCXW235.internal_condition"/>
    </condition>
    <condition id="component.pcm512x_adapter.condition_id">
      <require condition="allOf.device=MCXW235.internal_condition"/>
    </condition>
    <condition id="component.power_manager_framework.condition_id">
      <require condition="allOf.device=MCXW235.internal_condition"/>
    </condition>
    <condition id="component.pwm_ctimer_adapter.condition_id">
      <require condition="allOf.driver.ctimer, device=MCXW235.internal_condition"/>
    </condition>
    <condition id="component.reset_adapter.condition_id">
      <require condition="allOf.device=MCXW235.internal_condition"/>
    </condition>
    <condition id="component.rng_adapter_interface.condition_id">
      <require condition="allOf.anyOf=allOf=component.trng_adapter, driver.trng, component.software_rng_adapter, device=MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.trng_adapter, driver.trng, component.software_rng_adapter, device=MCXW235.internal_condition">
      <require condition="anyOf.allOf=component.trng_adapter, driver.trng, component.software_rng_adapter.internal_condition"/>
      <require condition="device.MCXW235.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.trng_adapter, driver.trng, component.software_rng_adapter.internal_condition">
      <accept condition="allOf.component.trng_adapter, driver.trng.internal_condition"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="software_rng_adapter"/>
    </condition>
    <condition id="allOf.component.trng_adapter, driver.trng.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="trng_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="trng"/>
    </condition>
    <condition id="component.rnga_adapter.condition_id">
      <require condition="allOf.device=MCXW235.internal_condition"/>
    </condition>
    <condition id="component.rt_gpio_adapter.condition_id">
      <require condition="allOf.driver.lpc_gpio, device=MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpc_gpio, device=MCXW235.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require condition="device.MCXW235.internal_condition"/>
    </condition>
    <condition id="component.serial_manager.condition_id">
      <require condition="allOf.anyOf=component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MCXW235.internal_condition">
      <require condition="anyOf.component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXW235.internal_condition"/>
    </condition>
    <condition id="anyOf.component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_spi"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_swo"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_virtual"/>
    </condition>
    <condition id="component.serial_manager_spi.condition_id">
      <require condition="allOf.anyOf=allOf=component.flexcomm_spi_adapter, driver.flexcomm_spi, device=MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.flexcomm_spi_adapter, driver.flexcomm_spi, device=MCXW235.internal_condition">
      <require condition="anyOf.allOf=component.flexcomm_spi_adapter, driver.flexcomm_spi.internal_condition"/>
      <require condition="device.MCXW235.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.flexcomm_spi_adapter, driver.flexcomm_spi.internal_condition">
      <accept condition="allOf.component.flexcomm_spi_adapter, driver.flexcomm_spi.internal_condition"/>
    </condition>
