vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXW235_DFP.pdsc
    <condition id="allOf.component.flexcomm_spi_adapter, driver.flexcomm_spi.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm_spi_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
    </condition>
    <condition id="component.serial_manager_swo.condition_id">
      <require condition="allOf.device=MCXW235.internal_condition"/>
    </condition>
    <condition id="component.serial_manager_uart.condition_id">
      <require condition="allOf.component.usart_adapter, device=MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.component.usart_adapter, device=MCXW235.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart_adapter"/>
      <require condition="device.MCXW235.internal_condition"/>
    </condition>
    <condition id="component.serial_manager_virtual.condition_id">
      <require condition="allOf.device=MCXW235.internal_condition"/>
    </condition>
    <condition id="component.sgtl_adapter.condition_id">
      <require condition="allOf.device=MCXW235.internal_condition"/>
    </condition>
    <condition id="component.software_crc_adapter.condition_id">
      <require condition="allOf.device=MCXW235.internal_condition"/>
    </condition>
    <condition id="component.software_rng_adapter.condition_id">
      <require condition="allOf.component.rng_adapter_interface, device=MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.component.rng_adapter_interface, device=MCXW235.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rng_adapter_interface"/>
      <require condition="device.MCXW235.internal_condition"/>
    </condition>
    <condition id="component.tfa9896_adapter.condition_id">
      <require condition="allOf.device=MCXW235.internal_condition"/>
    </condition>
    <condition id="component.tfa9xxx_adapter.condition_id">
      <require condition="allOf.device=MCXW235.internal_condition"/>
    </condition>
    <condition id="component.timer_manager.condition_id">
      <require condition="allOf.device=MCXW235.internal_condition"/>
    </condition>
    <condition id="component.trng_adapter.condition_id">
      <require condition="allOf.component.rng_adapter_interface, driver.trng, device=MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.component.rng_adapter_interface, driver.trng, device=MCXW235.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rng_adapter_interface"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="trng"/>
      <require condition="device.MCXW235.internal_condition"/>
    </condition>
    <condition id="component.usart_adapter.condition_id">
      <require condition="allOf.driver.flexcomm, driver.flexcomm_usart, device=MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexcomm, driver.flexcomm_usart, device=MCXW235.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
      <require condition="device.MCXW235.internal_condition"/>
    </condition>
    <condition id="component.wm8524_adapter.condition_id">
      <require condition="allOf.device=MCXW235.internal_condition"/>
    </condition>
    <condition id="component.wm8904_adapter.condition_id">
      <require condition="allOf.device=MCXW235.internal_condition"/>
    </condition>
    <condition id="component.wm8960_adapter.condition_id">
      <require condition="allOf.device=MCXW235.internal_condition"/>
    </condition>
    <condition id="component.wm8962_adapter.condition_id">
      <require condition="allOf.device=MCXW235.internal_condition"/>
    </condition>
    <condition id="device.CMSIS.condition_id">
      <require condition="allOf.CMSIS_Include_core_cm, device=MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Include_core_cm, device=MCXW235.internal_condition">
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="device.MCXW235.internal_condition"/>
    </condition>
    <condition id="device.MCXW235_flash.condition_id">
      <require condition="allOf.device=MCXW235.internal_condition"/>
    </condition>
    <condition id="device.RTE.condition_id">
      <require condition="allOf.driver.lpc_dma, device=MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpc_dma, device=MCXW235.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require condition="device.MCXW235.internal_condition"/>
    </condition>
    <condition id="device_id.MCXW235.internal_condition">
      <accept Dname="MCXW235AIHNAR" Dvendor="NXP:11"/>
      <accept Dname="MCXW235AIUKAR" Dvendor="NXP:11"/>
      <accept Dname="MCXW235BIHNAR" Dvendor="NXP:11"/>
      <accept Dname="MCXW235BIUKAR" Dvendor="NXP:11"/>
    </condition>
    <condition id="device.linker.condition_id">
      <require condition="allOf.device_id=MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MCXW235.internal_condition">
      <require condition="device_id.MCXW235.internal_condition"/>
    </condition>
    <condition id="device_ids.MCXW235.internal_condition">
      <accept Dname="MCXW235AIHNAR" Dvendor="NXP:11"/>
      <accept Dname="MCXW235AIUKAR" Dvendor="NXP:11"/>
      <accept Dname="MCXW235BIHNAR" Dvendor="NXP:11"/>
      <accept Dname="MCXW235BIUKAR" Dvendor="NXP:11"/>
    </condition>
    <condition id="allOf.toolchains=mdk, device_ids=MCXW235.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="device_ids.MCXW235.internal_condition"/>
    </condition>
    <condition id="toolchains.mdk.internal_condition">
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, device_ids=MCXW235.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="device_ids.MCXW235.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc.internal_condition">
      <accept Tcompiler="GCC"/>
    </condition>
    <condition id="allOf.toolchains=iar, device_ids=MCXW235.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="device_ids.MCXW235.internal_condition"/>
    </condition>
    <condition id="toolchains.iar.internal_condition">
      <accept Tcompiler="IAR"/>
    </condition>
    <condition id="device.project_template.condition_id">
      <require condition="allOf.component.usart_adapter, device_id=MCXW235, driver.common, device.startup, driver.clock, driver.power, driver.reset, driver.flexcomm, driver.flexcomm_usart, driver.lpc_gpio, driver.lpc_iocon, anyOf=allOf=component.serial_manager, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
