vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXW235_DFP.pdsc
    <condition id="allOf.component.usart_adapter, device_id=MCXW235, driver.common, device.startup, driver.clock, driver.power, driver.reset, driver.flexcomm, driver.flexcomm_usart, driver.lpc_gpio, driver.lpc_iocon, anyOf=allOf=component.serial_manager, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart_adapter"/>
      <require condition="device_id.MCXW235.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="Startup" Csub=""/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="reset"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="iocon"/>
      <require condition="anyOf.allOf=component.serial_manager, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.serial_manager, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition">
      <accept condition="allOf.component.serial_manager, utility.assert, utility.debug_console, utility.debug_console_template_config.internal_condition"/>
      <accept condition="allOf.utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
    <condition id="allOf.component.serial_manager, utility.assert, utility.debug_console, utility.debug_console_template_config.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug console template config"/>
    </condition>
    <condition id="allOf.utility.assert_lite, utility.debug_console_lite.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
    </condition>
    <condition id="device.startup.condition_id">
      <require condition="allOf.device.system, device=MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.device.system, device=MCXW235.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MCXW235_system"/>
      <require condition="device.MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, iar, mdk.condition_id">
      <require condition="toolchains.armgcc, iar, mdk.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc, iar, mdk.internal_condition">
      <accept Tcompiler="GCC"/>
      <accept Tcompiler="IAR"/>
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="device.system.condition_id">
      <require condition="allOf.device.CMSIS, device=MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.device.CMSIS, device=MCXW235.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MCXW235_header"/>
      <require condition="device.MCXW235.internal_condition"/>
    </condition>
    <condition id="driver.ak4497.condition_id">
      <require condition="allOf.component.ak4497_adapter, component.codec_adapters, component.codec_i2c, driver.codec, device=MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.component.ak4497_adapter, component.codec_adapters, component.codec_i2c, driver.codec, device=MCXW235.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXW235.internal_condition"/>
    </condition>
    <condition id="driver.anactrl.condition_id">
      <require condition="allOf.driver.common, device_id=MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device_id=MCXW235.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device_id.MCXW235.internal_condition"/>
    </condition>
    <condition id="driver.casper.condition_id">
      <require condition="allOf.driver.common, device_id=MCXW235.internal_condition"/>
    </condition>
    <condition id="driver.cdog.condition_id">
      <require condition="allOf.driver.common, device_id=MCXW235.internal_condition"/>
    </condition>
    <condition id="driver.clock.condition_id">
      <require condition="allOf.driver.power, device=MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.driver.power, device=MCXW235.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require condition="device.MCXW235.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_flexcomm_i2c.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.I2C, device.RTE, driver.flexcomm_i2c_dma, device=MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.I2C, device.RTE, driver.flexcomm_i2c_dma, device=MCXW235.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_dma"/>
      <require condition="device.MCXW235.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_flexcomm_spi.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.SPI, device.RTE, driver.flexcomm_spi_dma, device=MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.SPI, device.RTE, driver.flexcomm_spi_dma, device=MCXW235.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi_dma"/>
      <require condition="device.MCXW235.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_flexcomm_usart.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.USART, device.RTE, driver.flexcomm_usart_dma, device_id=MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.USART, device.RTE, driver.flexcomm_usart_dma, device_id=MCXW235.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.4.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart_dma"/>
      <require condition="device_id.MCXW235.internal_condition"/>
    </condition>
    <condition id="driver.codec.condition_id">
      <require condition="allOf.device=MCXW235.internal_condition"/>
    </condition>
    <condition id="driver.common.condition_id">
      <require condition="allOf.device=MCXW235.internal_condition"/>
    </condition>
    <condition id="allOf.cores=cm33.condition_id">
      <require condition="cores.cm33.internal_condition"/>
    </condition>
