vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXW235_DFP.pdsc
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="MCXW235_flash" Cversion="1.0.0" condition="device.MCXW235_flash.condition_id">
      <description>Device MCXW235_flash</description>
      <files>
        <file category="doc" name="devices/MCXW235/mcuxpresso/device.MCXW235_flash_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MCXW235/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXW235/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MCXW235_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MCXW235_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MCXW235.condition_id" category="linkerScript" attr="config" name="devices/MCXW235/arm/MCXW235_flash.scf" version="1.0.0" projectpath="MCXW235/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXW235.condition_id" category="linkerScript" attr="config" name="devices/MCXW235/gcc/MCXW235_flash.ld" version="1.0.0" projectpath="MCXW235/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXW235.condition_id" category="linkerScript" attr="config" name="devices/MCXW235/iar/MCXW235_flash.icf" version="1.0.0" projectpath="MCXW235/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MCXW235" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MCXW235</description>
      <files>
        <file category="header" attr="config" name="devices/MCXW235/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXW235/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXW235/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXW235/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXW235/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXW235/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXW235/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXW235/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXW235/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MCXW235_startup</description>
      <files>
        <file condition="allOf.toolchains=armgcc, iar, mdk.condition_id" category="sourceC" attr="config" name="devices/MCXW235/startup_MCXW235.c" version="1.0.0" projectpath="startup"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXW235_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MCXW235_system</description>
      <files>
        <file category="sourceC" name="devices/MCXW235/system_MCXW235.c" projectpath="device"/>
        <file category="header" name="devices/MCXW235/system_MCXW235.h" projectpath="device"/>
        <file category="include" name="devices/MCXW235/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497" Cversion="2.1.2" condition="driver.ak4497.condition_id">
      <description>Driver ak4497</description>
      <RTE_Components_h>
#ifndef CODEC_AK4497_ENABLE
#define CODEC_AK4497_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/ak4497/fsl_ak4497.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/ak4497/fsl_ak4497.c" projectpath="codec"/>
        <file category="include" name="components/codec/ak4497/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="anactrl" Cversion="2.4.0" condition="driver.anactrl.condition_id">
      <description>anactrl Driver</description>
      <files>
        <file category="header" name="devices/MCXW235/drivers/fsl_anactrl.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW235/drivers/fsl_anactrl.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="casper" Cversion="2.2.4" condition="driver.casper.condition_id">
      <description>CASPER Driver</description>
      <files>
        <file category="header" name="devices/MCXW235/drivers/fsl_casper.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW235/drivers/fsl_casper.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cdog" Cversion="2.1.3" condition="driver.cdog.condition_id">
      <description>cdog Driver</description>
      <files>
        <file category="header" name="devices/MCXW235/drivers/fsl_cdog.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW235/drivers/fsl_cdog.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.1.3" condition="driver.clock.condition_id">
      <description>Clock Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXW236/drivers/fsl_clock.c" projectpath="../MCXW236/drivers"/>
        <file category="header" name="devices/MCXW236/drivers/fsl_clock.h" projectpath="../MCXW236/drivers"/>
        <file category="include" name="devices/MCXW236/drivers/"/>
      </files>
    </component>
