vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXW235_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spi" Cversion="2.3.2" condition="driver.flexcomm_spi.condition_id">
      <description>SPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXW235/drivers/fsl_spi.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXW235/drivers/fsl_spi.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXW235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spi_dma" Cversion="2.2.2" condition="driver.flexcomm_spi_dma.condition_id">
      <description>SPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXW235/drivers/fsl_spi_dma.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXW235/drivers/fsl_spi_dma.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXW235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart" Cversion="2.8.5" condition="driver.flexcomm_usart.condition_id">
      <description>usart Driver</description>
      <files>
        <file category="header" name="devices/MCXW235/drivers/fsl_usart.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW235/drivers/fsl_usart.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart_dma" Cversion="2.3.1" condition="driver.flexcomm_usart_dma.condition_id">
      <description>usart Driver</description>
      <files>
        <file category="header" name="devices/MCXW235/drivers/fsl_usart_dma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW235/drivers/fsl_usart_dma.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gint" Cversion="2.1.1" condition="driver.gint.condition_id">
      <description>GINT Driver</description>
      <files>
        <file category="header" name="devices/MCXW235/drivers/fsl_gint.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW235/drivers/fsl_gint.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="hashcrypt" Cversion="2.2.17" condition="driver.hashcrypt.condition_id">
      <description>Hashcrypt Driver</description>
      <files>
        <file category="header" name="devices/MCXW235/drivers/fsl_hashcrypt.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW235/drivers/fsl_hashcrypt.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux" Cversion="2.0.9" condition="driver.inputmux.condition_id">
      <description>INPUTMUX Driver</description>
      <files>
        <file category="header" name="devices/MCXW235/drivers/fsl_inputmux.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW235/drivers/fsl_inputmux.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux_connections" Cversion="2.0.0" condition="driver.inputmux_connections.condition_id">
      <description>Inputmux_connections Driver</description>
      <files>
        <file category="header" name="devices/MCXW236/drivers/fsl_inputmux_connections.h" projectpath="../MCXW236/drivers"/>
        <file category="include" name="devices/MCXW236/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_crc" Cversion="2.1.1" condition="driver.lpc_crc.condition_id">
      <description>CRC Driver</description>
      <files>
        <file category="header" name="devices/MCXW235/drivers/fsl_crc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW235/drivers/fsl_crc.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dma" Cversion="2.5.3" condition="driver.lpc_dma.condition_id">
      <description>DMA Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXW235/drivers/fsl_dma.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXW235/drivers/fsl_dma.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXW235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gpio" Cversion="2.1.7" condition="driver.lpc_gpio.condition_id">
      <description>GPIO Driver</description>
      <files>
        <file category="header" name="devices/MCXW235/drivers/fsl_gpio.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW235/drivers/fsl_gpio.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="iocon" Cversion="2.2.0" condition="driver.lpc_iocon.condition_id">
      <description>IOCON Driver</description>
      <files>
        <file category="header" name="devices/MCXW235/drivers/fsl_iocon.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXW235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_rtc" Cversion="2.2.0" condition="driver.lpc_rtc.condition_id">
      <description>RTC Driver</description>
      <files>
        <file category="header" name="devices/MCXW235/drivers/fsl_rtc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW235/drivers/fsl_rtc.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mailbox" Cversion="2.3.4" condition="driver.mailbox.condition_id">
      <description>MAILBOX Driver</description>
      <files>
        <file category="header" name="devices/MCXW235/drivers/fsl_mailbox.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXW235/drivers/"/>
      </files>
    </component>
