vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXW235_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mrt" Cversion="2.0.5" condition="driver.mrt.condition_id">
      <description>MRT Driver</description>
      <files>
        <file category="header" name="devices/MCXW235/drivers/fsl_mrt.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW235/drivers/fsl_mrt.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer" Cversion="2.2.5" condition="driver.ostimer.condition_id">
      <description>OSTimer Driver</description>
      <files>
        <file category="header" name="devices/MCXW235/drivers/fsl_ostimer.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW235/drivers/fsl_ostimer.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pca9420" Cversion="1.0.0" condition="driver.pca9420.condition_id">
      <description>Driver pca9420</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="components/pmic/pca9420/fsl_pca9420.c" projectpath="component/pmic/pca9420"/>
        <file category="header" name="components/pmic/pca9420/fsl_pca9420.h" projectpath="component/pmic/pca9420"/>
        <file category="include" name="components/pmic/pca9420/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pca9422" Cversion="1.0.0" condition="driver.pca9422.condition_id">
      <description>Driver pca9422</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="components/pmic/pca9422/fsl_pca9422.c" projectpath="component/pmic/pca9422"/>
        <file category="header" name="components/pmic/pca9422/fsl_pca9422.h" projectpath="component/pmic/pca9422"/>
        <file category="include" name="components/pmic/pca9422/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pcm186x" Cversion="2.0.1" condition="driver.pcm186x.condition_id">
      <description>Driver pcm186x</description>
      <RTE_Components_h>
#ifndef CODEC_PCM186X_ENABLE
#define CODEC_PCM186X_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/pcm186x/fsl_pcm186x.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/pcm186x/fsl_pcm186x.c" projectpath="codec"/>
        <file category="include" name="components/codec/pcm186x/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pcm512x" Cversion="2.0.1" condition="driver.pcm512x.condition_id">
      <description>Driver pcm512x</description>
      <RTE_Components_h>
#ifndef CODEC_PCM512X_ENABLE
#define CODEC_PCM512X_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/pcm512x/fsl_pcm512x.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/pcm512x/fsl_pcm512x.c" projectpath="codec"/>
        <file category="include" name="components/codec/pcm512x/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pf1550" Cversion="1.0.0" condition="driver.pf1550.condition_id">
      <description>Driver pf1550</description>
      <files>
        <file category="sourceC" name="components/pmic/pf1550/fsl_pf1550.c" projectpath="component/pmic/pf1550"/>
        <file category="header" name="components/pmic/pf1550/fsl_pf1550.h" projectpath="component/pmic/pf1550"/>
        <file category="sourceC" name="components/pmic/pf1550/fsl_pf1550_charger.c" projectpath="component/pmic/pf1550"/>
        <file category="header" name="components/pmic/pf1550/fsl_pf1550_charger.h" projectpath="component/pmic/pf1550"/>
        <file category="include" name="components/pmic/pf1550/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pf3000" Cversion="1.0.0" condition="driver.pf3000.condition_id">
      <description>Driver pf3000</description>
      <files>
        <file category="sourceC" name="components/pmic/pf3000/fsl_pf3000.c" projectpath="component/pmic/pf3000"/>
        <file category="header" name="components/pmic/pf3000/fsl_pf3000.h" projectpath="component/pmic/pf3000"/>
        <file category="include" name="components/pmic/pf3000/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pf5020" Cversion="2.0.0" condition="driver.pf5020.condition_id">
      <description>Driver pf5020</description>
      <files>
        <file category="sourceC" name="components/pmic/pf5020/fsl_pf5020.c" projectpath="component/pmic/pf5020"/>
        <file category="header" name="components/pmic/pf5020/fsl_pf5020.h" projectpath="component/pmic/pf5020"/>
        <file category="include" name="components/pmic/pf5020/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pint" Cversion="2.2.0" condition="driver.pint.condition_id">
      <description>PINT Driver</description>
      <files>
        <file category="header" name="devices/MCXW235/drivers/fsl_pint.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW235/drivers/fsl_pint.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="plu" Cversion="2.2.1" condition="driver.plu.condition_id">
      <description>PLU Driver</description>
      <files>
        <file category="header" name="devices/MCXW235/drivers/fsl_plu.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW235/drivers/fsl_plu.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="power" Cversion="3.0.0" condition="driver.power.condition_id">
      <description>Power driver</description>
      <files>
        <file category="header" name="devices/MCXW236/drivers/fsl_power.h" projectpath="../MCXW236/drivers"/>
        <file category="header" name="devices/MCXW236/drivers/fsl_system.h" projectpath="../MCXW236/drivers"/>
        <file category="sourceC" name="devices/MCXW236/drivers/fsl_power.c" projectpath="../MCXW236/drivers"/>
        <file category="sourceC" name="devices/MCXW236/drivers/fsl_system.c" projectpath="../MCXW236/drivers"/>
        <file category="include" name="devices/MCXW236/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="PUF" Cversion="2.2.0" condition="driver.puf.condition_id">
      <description>PUF Driver</description>
      <files>
        <file category="header" name="devices/MCXW235/drivers/fsl_puf.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW235/drivers/fsl_puf.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW235/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="reset" Cversion="2.0.1" condition="driver.reset.condition_id">
      <description>Reset Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXW236/drivers/fsl_reset.c" projectpath="../MCXW236/drivers"/>
        <file category="header" name="devices/MCXW236/drivers/fsl_reset.h" projectpath="../MCXW236/drivers"/>
        <file category="include" name="devices/MCXW236/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="romapi" Cversion="1.0.0" condition="driver.romapi.condition_id">
      <description>ROMAPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXW236/drivers/fsl_rom_api.c" projectpath="../MCXW236/drivers"/>
        <file category="header" name="devices/MCXW236/drivers/fsl_rom_api.h" projectpath="../MCXW236/drivers"/>
        <file category="header" name="devices/MCXW236/drivers/fsl_iap.h" projectpath="../MCXW236/drivers"/>
        <file category="header" name="devices/MCXW236/drivers/fsl_iap_ffr.h" projectpath="../MCXW236/drivers"/>
        <file category="header" name="devices/MCXW236/drivers/fsl_iap_kbp.h" projectpath="../MCXW236/drivers"/>
        <file category="include" name="devices/MCXW236/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtt" Cversion="7.22.0" condition="driver.rtt.condition_id">
      <description>SEGGER Real Time Transfer(RTT)</description>
      <files>
        <file category="doc" name="components/rtt/License.txt" projectpath="rtt"/>
        <file category="doc" name="components/rtt/README.txt" projectpath="rtt"/>
        <file category="sourceC" name="components/rtt/RTT/SEGGER_RTT.c" projectpath="rtt/RTT"/>
        <file category="header" name="components/rtt/RTT/SEGGER_RTT.h" projectpath="rtt/RTT"/>
        <file category="sourceAsm" name="components/rtt/RTT/SEGGER_RTT_ASM_ARMv7M.S" projectpath="rtt/RTT"/>
        <file category="sourceC" name="components/rtt/RTT/SEGGER_RTT_printf.c" projectpath="rtt/RTT"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_GCC.c" projectpath="rtt/Syscalls"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_IAR.c" projectpath="rtt/Syscalls"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_KEIL.c" projectpath="rtt/Syscalls"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_SES.c" projectpath="rtt/Syscalls"/>
        <file category="doc" name="components/rtt/License.txt" projectpath="rtt"/>
        <file category="doc" name="components/rtt/README.txt" projectpath="rtt"/>
        <file category="include" name="components/rtt/RTT/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtt template" Cversion="7.22.0" condition="driver.rtt.template.condition_id">
      <description>RTT template configuration</description>
      <files>
        <file category="header" attr="config" name="components/rtt/template/SEGGER_RTT_Conf.h" version="7.22.0" projectpath="rtt/template"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sctimer" Cversion="2.5.1" condition="driver.sctimer.condition_id">
      <description>SCT Driver</description>
      <files>
        <file category="header" name="devices/MCXW235/drivers/fsl_sctimer.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW235/drivers/fsl_sctimer.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW235/drivers/"/>
      </files>
    </component>
